<?php

return [
    'power_company_rates' => [
        '北海道電力ネットワーク(株)' => 0.445,
        '東北電力ネットワーク(株)' => 0.445,
        '東京電力パワーグリッド(株)' => 0.445,
        '中部電力パワーグリッド(株)' => 0.445,
        '北陸電力送配電(株)' => 0.445,
        '関西電力送配電(株)' => 0.445,
        '中国電力ネットワーク(株)' => 0.445,
        '四国電力送配電(株)' => 0.445,
        '九州電力送配電(株)' => 0.445,
        '沖縄電力(株)' => 0.696,
        'その他' => 0.445,
    ],

    'food_carbon_rate' => [
        '定食' => [
            '小盛り' => 150,
            '普通盛り' => 160,
            '大盛り' => 200,
        ],
        '丼' => [
            '小盛り' => 200,
            '普通盛り' => 260,
            '大盛り' => 320,
        ],
        '麺類' => [
            '小盛り' => 150,
            '普通盛り' => 180,
            '大盛り' => 300,
        ],
        'パン' => [
            '小盛り' => 186,
            '普通盛り' => 196,
            '大盛り' => 239,
        ],
    ],

    'rice_carbon_rate' => [
        '定食' => 1.3,
        '丼' => 1.3,
        '麺類' => 1.7,
        'パン' => 1.3,
    ],

    'vegetable_volume_rate' => [
        '定食' => [
            '多い' => 150,
            '普通' => 100,
            '少ない' => 50,
        ],
        '丼' => [
            '多い' => 120,
            '普通' => 80,
            '少ない' => 50,
        ],
        '麺類' => [
            '多い' => 50,
            '普通' => 30,
            '少ない' => 10,
        ],
        'パン' => [
            '多い' => 150,
            '普通' => 100,
            '少ない' => 50,
        ],
    ],

    'vegetable_carbon_rate' => [
        'トマト' => [
            '冬' => 1.6,
            '春' => 1.6,
            '夏' => 0.6,
            '秋' => 0.6,
        ],
        'きゅうり' => [
            '冬' => 1.7,
            '春' => 1.7,
            '夏' => 0.6,
            '秋' => 0.6,
        ],
        'ピーマン' => [
            '冬' => 3.5,
            '春' => 3.5,
            '夏' => 0.7,
            '秋' => 0.7,
        ],
        'なす' => [
            '冬' => 1.7,
            '春' => 1.7,
            '夏' => 0.3,
            '秋' => 0.3,
        ],
        'キャベツ' => [
            '冬' => 0.2,
            '春' => 0.2,
            '夏' => 0.3,
            '秋' => 0.3,
        ],
        'ほうれん草' => [
            '冬' => 0.7,
            '春' => 0.7,
            '夏' => 0.7,
            '秋' => 0.7,
        ],
        'ねぎ' => [
            '冬' => 0.6,
            '春' => 0.6,
            '夏' => 0.75,
            '秋' => 0.7,
        ],
        'レタス' => [
            '冬' => 0.45,
            '春' => 0.4,
            '夏' => 0.35,
            '秋' => 0.35,
        ],
        '白菜' => [
            '冬' => 0.2,
            '春' => 0.2,
            '夏' => 0.25,
            '秋' => 0.2,
        ],
        'さといも' => [
            '冬' => 0.4,
            '春' => 0.4,
            '夏' => 0.4,
            '秋' => 0.4,
        ],
        'だいこん' => [
            '冬' => 0.2,
            '春' => 0.3,
            '夏' => 0.25,
            '秋' => 0.2,
        ],
        'にんじん' => [
            '冬' => 0.3,
            '春' => 0.25,
            '夏' => 0.25,
            '秋' => 0.3,
        ],
        '玉ねぎ' => [
            '冬' => 0.3,
            '春' => 0.3,
            '夏' => 0.3,
            '秋' => 0.3,
        ],
        '豆類' => [
            '冬' => 1.5,
            '春' => 1.5,
            '夏' => 1.5,
            '秋' => 1.5,
        ],
        '野菜（そのほか）' => [
            '冬' => 0.9,
            '春' => 0.9,
            '夏' => 0.9,
            '秋' => 0.9,
        ],
    ],

    'main_carbon_rate' => [
        'さんま' => 1,
        'さば' => 0.8,
        'さけ・ます' => 0.7,
        'ぶり' => 2.3,
        'まぐろ' => 4.3,
        '魚介類（そのほか）' => 3.33,
        '乳製品' => 3.6,
        '卵' => 1.5,
        '鶏肉' => 2.5,
        '豚肉（国産）' => 3.8,
        '豚肉（輸入）' => 5.3,
        '牛肉（国産）' => 15.2,
        '牛肉（輸入）' => 13.5,
        '肉類（そのほか）' => 8.25,
    ],

    'main_volume_rate' => [
        '定食' => [
            '多い' => 150,
            '普通' => 100,
            '少ない' => 50,
        ],
        '丼' => [
            '多い' => 120,
            '普通' => 80,
            '少ない' => 50,
        ],
        '麺類' => [
            '多い' => 50,
            '普通' => 30,
            '少ない' => 10,
        ],
        'パン' => [
            '多い' => 150,
            '普通' => 100,
            '少ない' => 50,
        ],
    ],

    'sports_carbon_rate' => [
        'store' => [
            '散歩' => 0.12015,
            'ジョギング' => 0.12015,
            '筋トレ' => 0.12015,
            '泳ぐ' => 0.12015,
            'ヨガ' => 0.12015,
            '瞑想' => 0.12015,
        ],
        'update' => [
            '散歩' => 1.5,
            'ジョギング' => 1.5,
            '筋トレ' => 1.5,
            '泳ぐ' => 1.5,
            'ヨガ' => 1.5,
            '瞑想' => 1.5,
        ],
    ],

    'rest_carbon_rate' => [
        '街歩き' => 0,
        '近所の人とおしゃべり' => 0,
        'テレビ' => 0.065,
        'ゲーム' => 0.016,
    ],

    'shopping_carbon_rate' => [
        'shopping_ce' => 0.003141,
        'shopping_cloth' => 0.003001,
        'shopping_hobby' => 0.002492,
        'shopping_office' => 0.005263,
        'shopping_daily' => 0.00303,
        'shopping_tabacco' => 0.001262,
        'shopping_other' => 0.003756,
    ],

    'move_type_rate' => [
        '飛行機' => 0.098,
        '電車' => 0.017,
        'バス' => 0.057,
        '徒歩' => 0,
        '車（タクシー）' => 0.13,
        '自転車' => 0,
    ],
];
